{
  "home": "Home",
  "services": "Softwaredienstleistungen",
  "projects": "Projekte",
  "about": "Über",
  "contact": "Kontakt",
  "cv": "Lebenslauf",
  "homePage": {
    "aboutTeaserTitle": "Über",
    "aboutTeaserDescription": "Ihre digitale Präsenz verdient mehr als nur eine Vorlage. Hieroglyph Code ist Ihr All-in-One-Partner für massgeschneiderte Web- und Mobile-Entwicklung, von der Konzeption bis zur Fertigstellung und darüber hinaus.<h5>Geleitet von Expertise</h5>Geleitet von Ilya Medvedev, einem zertifizierten Full-Stack-Entwickler aus Basel, Schweiz, widmet sich Hieroglyph Code der leidenschaftlichen Umwandlung komplexer Ideen in elegante, benutzerfreundliche Software. Durch die Kombination von technischer Präzision und kreativer Vision liefert das Unternehmen massgeschneiderte Lösungen, die Ihre digitale Präsenz wirklich aufwerten.<h5>Ein Fokus auf Schlüssel-Dienstleistungen</h5><ul><li><strong>Full-Stack-Entwicklung:</strong> Leistungsstarke Full-Stack-Applikationen, die reaktionsschnell und schnell sind.</li><li><strong>Spezialisierte Funktionen:</strong> Zu den Dienstleistungen gehören die Erstellung von APIs, robusten E-Commerce-Plattformen, sicheren Anmeldesystemen und nahtlosen Zahlungsintegrationen.</li><li><strong>Wartung & Support:</strong> Zuverlässige, laufende Wartung und Updates, um sicherzustellen, dass Ihre digitalen Tools stets reibungslos funktionieren.</li></ul>",
    "learnMoreButton": "Mehr erfahren"
  },
  "carousel": {
    "globalTitle": "Hieroglyph Code: Digitale Exzellenz gestalten",
    "globalDescription": "Ihre Vision wird in robuste, intuitive und visuell beeindruckende Softwarelösungen verwandelt.",
    "learnMoreButton": "Erfahren Sie mehr über diesen Service"
  },
  "projectsPage": {
    "title": "Projekte",
    "viewButton": "Details ansehen"
  },
  "servicesPage": {
    "title": "Softwaredienstleistungen",
    "viewButton": "Details ansehen"
  },
  "cardPage": {
    "productNotFound": "Produkt nicht gefunden",
    "technologiesUsed": "Verwendete Technologien:",
    "siteLink": "Website-Link:"
  },
  "products": {
    "200": {
      "title": "Entwicklung von Webanwendungen & E-Commerce",
      "description": "Robuste Webanwendungen und hochkonvertierende E-Commerce-Plattformen werden entwickelt. Die Lösungen werden mit JavaScript und TypeScript für eine skalierbare und wartbare Codebasis erstellt. Durch den Einsatz moderner Frameworks werden leistungsstarke und ansprechende Webanwendungen konzipiert.<h5>Wichtige Merkmale & Technologien</h5><ul><li><strong>Front-End-Entwicklung:</strong> Ausgefeilte und intuitive Benutzeroberflächen werden mit modernsten Frameworks wie React, Next.js, Vue.js und Svelte erstellt. Für eine optimierte Inhaltsbereitstellung und Leistung werden auch Technologien wie SvelteKit und Bunny.net CDN verwendet.</li><li><strong>Back-End-Systeme:</strong> Das Backend wird auf Node.js aufgebaut, um eine skalierbare und sichere Grundlage zu schaffen. Für spezifische Anforderungen können auch andere robuste serverseitige Sprachen wie Java oder Golang integriert werden.</li><li><strong>E-Commerce & Zahlungen:</strong> Sichere Transaktionen und eine felsenfeste Grundlage für das Wachstum werden durch die Integration führender Zahlungs-Gateways wie Stripe, PayPal und anderer direkter Zahlungsmethoden gewährleistet.</li></ul>"
    },
    "201": {
      "title": "UI/UX Design & Prototyping",
      "description": "Ein aussergewöhnliches digitales Produkt beginnt mit einem herausragenden Benutzererlebnis. Spezialisierung auf die Gestaltung intuitiver, ansprechender und visuell beeindruckender Benutzeroberflächen (UI) und Benutzererlebnisse (UX), die das Publikum fesseln.<h5>Wichtige Merkmale & Prozess</h5><ul><li><strong>Benutzerzentriertes Design:</strong> Der umfassende Prozess deckt alles ab, von der anfänglichen Benutzerforschung und detaillierten Wireframing bis hin zu interaktiven Prototypen und ausgefeilten finalen Designs.</li><li><strong>Intuitive Erlebnisse:</strong> Der Fokus liegt darauf, dass ein digitales Produkt nicht nur funktional, sondern auch eine Freude in der Nutzung und ein unvergessliches Erlebnis für jeden Benutzer ist.</li></ul>"
    },
    "202": {
      "title": "Mobile App Entwicklung",
      "description": "Innovative Ideen werden durch die Entwicklung leistungsstarker, responsiver mobiler Anwendungen mit React Native an die Fingerspitzen von Millionen gebracht. Dies gewährleistet ein flüssiges und konsistentes Benutzererlebnis auf iOS und Android.<h5>Kernkomponenten</h5><ul><li><strong>UI/UX Design:</strong> Das Erstellen intuitiver UI/UX-Designs wird von Redux für nahtloses Zustandsmanagement unterstützt.</li><li><strong>Backend-Integration:</strong> Robuste Backend-Systeme werden integriert, um sicherzustellen, dass Apps sich wirklich von der Masse abheben.</li><li><strong>Visuals & Funktionalität:</strong> Erwarten Sie pixelgenaue Visuals und eine unerschütterliche Funktionalität bei jedem Tippen und Wischen, die darauf ausgelegt sind, Benutzer zu binden und zum Wiederkommen zu bewegen.</li></ul>"
    },
    "203": {
      "title": "Leistungsoptimierung & SEO-Audits",
      "description": "Signifikante Steigerung der Website-Sichtbarkeit und Verbesserung des Benutzererlebnisses durch spezialisierte Leistungs- und SEO-Audits.<h5>Audit-Prozess</h5><ul><li><strong>Eingehende Analyse:</strong> Der Prozess beinhaltet eine eingehende Analyse einer Website, um Geschwindigkeitsengpässe zu identifizieren, Core Web Vitals zu bewerten und die optimale Suchmaschinenfreundlichkeit zu gewährleisten.</li><li><strong>Umsetzbare Berichte:</strong> Der Service bietet detaillierte, umsetzbare Berichte und strategische Empfehlungen zur dramatischen Verbesserung von Ladezeiten, Reaktionsfähigkeit und organischen Suchrankings.</li><li><strong>Zielorientierte Ergebnisse:</strong> Das Ziel ist es, sicherzustellen, dass eine Website ihr volles Potenzial ausschöpft und ein deutlich grösseres Publikum anzieht.</li></ul>"
    },
    "204": {
      "title": "Kundenspezifische API-Entwicklung & Integration",
      "description": "Die mühelose Kommunikation verschiedener Systeme wird ermöglicht und ein leistungsstarkes Backend für innovative Anwendungen wird bereitgestellt. Spezialisierung auf die Gestaltung und den Aufbau sicherer, skalierbarer und hocheffizienter APIs (Application Programming Interfaces). Ob beim Entwurf einer benutzerdefinierten RESTful oder GraphQL API von Grund auf oder bei der nahtlosen Integration mit wesentlichen Drittanbieterdiensten wie Zahlungs-Gateways oder CRM-Systemen, der Fokus liegt stets auf der Gewährleistung eines reibungslosen Datenflusses und einer makellosen Konnektivität, die den Betrieb stärkt.<h5>Kernfunktionen & Technologien</h5><ul><li><strong>API-Entwicklung:</strong> Kundenspezifische APIs werden von Grund auf entwickelt, um einzigartige Anforderungen zu erfüllen und Anwendungen die Kommunikation mit anderen Diensten und den Abruf von Daten aus externen Ressourcen zu ermöglichen.</li><li><strong>Kerntechnologien:</strong> Die Backend-APIs werden mit leistungsstarken serverseitigen Technologien wie Node.js mit Frameworks wie Express.js, NestJS oder Koa.js entwickelt. Bibliotheken wie Mongoose (für MongoDB) oder Sequelize (für SQL-Datenbanken) werden ebenfalls zur Datenverwaltung eingesetzt. Datenintegrität und Sicherheit werden durch ordnungsgemässe Validierungs- und Authentifizierungsmethoden gewährleistet.</li></ul>"
    },
    "205": {
      "title": "Website-Wartung & Content-Management",
      "description": "Eine Website ist ein lebendiges Gut, und die Dienstleistungen stellen sicher, dass sie scharf, sicher und stets auf dem neuesten Stand bleibt.<h5>Wartungsdienste</h5><ul><li><strong>Umfassende Abdeckung:</strong> Website-Wartung deckt sowohl die Frontend-Optimierung als auch die kritische Backend-Stabilität ab.</li><li><strong>Proaktives Management:</strong> Der Prozess beinhaltet regelmässige Updates, entscheidende Leistungsoptimierungen und sorgfältiges Content-Management. Vom Bereinigen ungenutzter Dateien bis zur Integration aufregender neuer Funktionen werden die Websites proaktiv verwaltet.</li><li><strong>Kundenfokus:</strong> Dies ermöglicht einem Kunden, sich voll und ganz auf sein Kerngeschäft zu konzentrieren, mit der Gewissheit, dass seine Online-Plattform stets Höchstleistungen erbringt.</li></ul>"
    },
    "206": {
      "title": "WordPress-Entwicklung",
      "description": "Die volle Kraft einer Online-Präsenz wird durch massgeschneiderte WordPress-Lösungen freigesetzt, die genau auf spezifische Bedürfnisse zugeschnitten sind.<h5>Entwicklung & Funktionalität</h5><ul><li><strong>E-Commerce & Veranstaltungen:</strong> Der Service handhabt alles von der Einrichtung eines leistungsstarken E-Commerce-Shops mit WooCommerce bis zur Verwaltung komplexer Veranstaltungspläne.</li><li><strong>Mehrsprachige Unterstützung:</strong> Ein nahtloses mehrsprachiges Erlebnis wird mit Tools wie Polylang geschaffen.</li><li><strong>Massgeschneiderte Lösungen:</strong> Von der anfänglichen Kerninstallation bis zur massgeschneiderten Plugin-Entwicklung wird eine WordPress-Seite robust, benutzerfreundlich und perfekt auf die einzigartigen Geschäftsziele abgestimmt sein, um maximale Wirkung zu erzielen.</li></ul>"
    },
    "207": {
      "title": "Statische Website-Entwicklung",
      "description": "Websites werden erstellt, die blitzschnell laden und ein gestochen scharfes Benutzererlebnis bieten.<h5>Wichtige Merkmale</h5><ul><li><strong>Blitzschnelle Leistung:</strong> Spezialisierung auf den Bau blitzschneller statischer Websites unter Verwendung von reinem Vanilla JavaScript, HTML5 und SCSS.</li><li><strong>Hohe Optimierung:</strong> Diese Websites sind nicht nur optisch ansprechend; sie sind auch hochgradig für Geschwindigkeit optimiert, von Natur aus sicher und auf maximale Effizienz ausgelegt.</li><li><strong>Ideale Anwendungsfälle:</strong> Perfekt für dynamische Portfolios, wirkungsvolle Marketingseiten oder jedes Projekt, bei dem sofortiges Laden und makelloses Design von grösster Bedeutung sind, um eine Botschaft sofort zu fesseln.</li></ul>"
    },
    "208": {
      "title": "Progressive Web App (PWA) Entwicklung",
      "description": "Die Lücke zwischen traditionellen Web- und nativen mobilen Anwendungen wird mit einer Progressive Web App (PWA) nahtlos überbrückt. Eine bestehende Webpräsenz kann in eine installierbare, app-ähnliche Erfahrung umgewandelt werden, die sich wirklich auszeichnet.<h5>Kern-PWA-Vorteile</h5><ul><li><strong>Verbesserte Leistung:</strong> Die Apps funktionieren offline und laden sofort.</li><li><strong>Erhöhtes Engagement:</strong> Sie sind in der Lage, reichhaltige Push-Benachrichtigungen direkt an die Benutzer zu senden.</li><li><strong>Verbesserte Zugänglichkeit:</strong> Ein beispielloses Benutzerengagement und eine verbesserte Zugänglichkeit werden ohne die Notwendigkeit komplexer App-Store-Downloads geliefert, was eine bemerkenswert reibungslose und schnelle Erfahrung auf allen Geräten und Netzwerken bietet.</li></ul>"
    },
    "100": {
      "title": "Anwendung für demokratische Abstimmungen",
      "description": "Mitwirkung bei der Entwicklung von benutzerdefinierten Popup-Komponenten für die delib-5.web.app-Plattform. Das Projekt nutzte Figma für das Design und Next.js mit TypeScript für die Implementierung.<h5>Wichtige Beiträge</h5><ul><li><strong>Interaktive Popups:</strong> Eine doppelseitige Popup-Komponente wurde mit vollständig interaktiven Elementen entwickelt, die es den Benutzern ermöglichen, zwischen den beiden Seiten zu navigieren und zur ersten zurückzukehren.</li><li><strong>Fehlerbehebungen & Leistung:</strong> Die Arbeit umfasste auch Fehlerbehebungen und CSS-Korrekturen, was zu einer spürbaren Verbesserung der allgemeinen Site-Funktionalität und Leistung um 15% führte.</li><li><strong>Zusammenarbeit:</strong> Dies war eine gemeinschaftliche Anstrengung mit einem achtköpfigen Team, wobei die gesamte Arbeit über Slack koordiniert wurde, um eine nahtlose Kommunikation und Fortschritte zu gewährleisten.</li></ul>"
    },
    "101": {
        "title": "Anwendung für Musikstudien",
        "description": "Maintenance and active development of frontend components for a Swiss-based music application that provides online and in-person lessons for students.<h5>Development & Technology</h5><ul><li><strong>Frontend Development:</strong> As part of this effort, two new front-page components were added and translated into four languages (English, French, Italian, and Spanish), improving the site's homepage explanation by 30% and giving users a clearer understanding of the platform's purpose. The platform uses Svelte and SvelteKit.</li><li><strong>Integrations:</strong> Payment services were integrated via Stripe, and content delivery was optimized with BunnyNet CDN.</li><li><strong>Project Ecosystem:</strong> The project operates within a comprehensive development ecosystem that includes a Golang backend, Postgres DB, Docker, Heroku, and GitLab for seamless collaboration and deployment.</li></ul>"
    },
    "102": {
        "title": "Plattform für Orchesterkonzerte",
        "description": "A comprehensive, multilingual WordPress website was developed for a Swiss-based philharmonic orchestra.<h5>Platform Features & Development</h5><ul><li><strong>Custom Event Management:</strong> The platform features a custom event management system, with core functionality extended through deep customization of PHP files.</li><li><strong>Multilingual Support:</strong> The site is fully translatable via the Polylang plugin, ensuring a seamless experience for a diverse audience.</li><li><strong>Technical Scope:</strong> The project scope included domain implementation, SSL certificate management, secure hosting deployment, and ongoing maintenance of the MySQL database and PHP backend to ensure long-term stability and performance.</li></ul>"
    },
    "103": {
        "title": "Website für Mobile Psychologische Therapiedienste",
        "description": "A bespoke, high-performance website was developed for a psychological support practice. Built from scratch using Vanilla JavaScript, styled with SASS and CSS, and powered by a Node.js backend, the site is exceptionally lightweight and fast.<h5>Project Scope & Features</h5><ul><li><strong>Development & Deployment:</strong> The entire project lifecycle, from initial design to production deployment, was handled with demonstrated expertise in domain registration, DNS management, SSL/TLS configuration, and cloud deployment via Firebase.</li><li><strong>Interactive Elements:</strong> The application features a custom 'read more/read less' button, a dynamic testimonials component and a picture gallery. Additionally, the privacy policy was meticulously crafted to meet official Swiss medical health standards.</li><li><strong>Analytics & Optimization:</strong> For ongoing optimization, Google Analytics was deployed to track site functionality and user activity, providing data used for continuous improvement of the user experience.</li></ul>"
    },
    "104": {
        "title": "Benutzerdefinierte E-Commerce-Plattform Online-Shop",
        "description": "Development of a high-converting online store with secure payments and inventory management, engineered to significantly boost client sales. The platform's architecture is built with a focus on performance, scalability, and a seamless user experience, utilizing a robust RESTful API for efficient data handling. <h5>Front-End Components and User Experience</h5> <ul> <li><strong>Product Card & Detail Page:</strong> A custom card component provides a clean display of products. Clicking a card opens a dedicated product page with a custom-developed image gallery featuring a thumbnail-based navigation system and a smooth zoom component for detailed viewing. Each product page includes a likes counter, a view counter, and product sharing options via social media or a direct link.</li> <li><strong>Navigation & Discovery:</strong> The site employs multiple product carousel components to enhance user discovery. These include a homepage carousel for featured products, a carousel for similar items based on a user's current view, and another for additional related products. A search bar is also available, providing users with a fast and efficient way to find products.</li> <li><strong>Interactive Features:</strong> Core components were developed to improve site usability and performance. This includes a lazy-load component to optimize loading times, a 'push up' button for easy navigation, and a notification popup for age-gated content, limiting adult product viewing for users under 18.</li> </ul> <h5>Backend and Core Functionality</h5> <ul> <li><strong>Secure Transactions:</strong> The Stripe payment component and shopping basket component were implemented to handle secure transactions and inventory management. This integration ensures a smooth and reliable checkout process for customers.</li> <li><strong>User Authentication:</strong> A Login component was integrated, offering users the convenience of a Google account for quick and easy sign-in.</li> </ul> <h5>Unique Features</h5> <ul> <li><strong>Audio Player:</strong> A custom audio player component was developed and placed in the footer, providing a unique user experience. It allows users to start music upon entering the site, with controls for volume and mute.</li> </ul>"
    },
    "105": {
        "title": "Messenger-Komponente für Mobile App",
        "description": "A front-end messenger component was developed for a mobile application, built using React Native.<h5>Component Features</h5><ul><li><strong>User Interface:</strong> The component features a user's name and photo, text fields, message timestamps, a message notification icon with an unread count, and read/unread status arrows.</li><li><strong>Functionality:</strong> A search bar was also included to allow users to search for specific users or messages.</li><li><strong>Interactive Elements:</strong> An additional popup component was created to include a 'write a message' button, as well as buttons for location, notifications, and announcements, providing a comprehensive and intuitive user experience.</li></ul>"
    },
    "106": {
        "title": "Web-App für Softwaredienstleistungen",
        "description": "A dynamic web application and portfolio site that demonstrates the creation of robust digital products from concept to completion. This project showcases my expertise as a full-stack developer, combining elegant design with a modern, scalable architecture.<h5>Key Features</h5><ul><li><strong>Responsive Design:</strong> The application is fully responsive, providing a seamless user experience across all devices, including mobile, tablet, and desktop.</li><li><strong>Dynamic Content:</strong> Custom-built components, such as a fully interactive photo gallery with zoom functionality and dynamic carousels, handle products and testimonials.</li><li><strong>Intuitive UX/UI:</strong> Every element, from the navigation menu to the contact form, was meticulously designed for user-friendliness and visual appeal, ensuring effortless engagement.</li></ul><h5>Technology & Architecture</h5><ul><li><strong>Front-End:</strong> Built with React and TypeScript, ensuring a robust and maintainable codebase.</li><li><strong>Back-End:</strong> Powered by Node.js, with a hybrid architecture that leverages API calls for dynamic image assets while using a local JSON data source for content.</li><li><strong>Workflow:</strong> An automated CI/CD pipeline was configured with GitHub Actions and Firebase Hosting, ensuring reliable, hands-off deployment.</li></ul>",
        "link": "https://hieroglyphcode.ch/",
        "githubLink": "https://github.com/mementomori16/hieroglyph-code"
    }

  },
  "testimonials": {
    "title": "Kundenstimmen",
    "subtitle": "Entdecken Sie die wahre Wirkung unserer Softwarelösungen, direkt von unseren Partnern.",
    "readMoreButton": "Weiterlesen",
    "ariaLabels": {
      "previousTestimonial": "Vorheriges Testimonial",
      "nextTestimonial": "Nächstes Testimonial",
      "goToSlide": "Gehe zu Folie {{slideNumber}}",
      "closeModal": "Modal schliessen"
    },
    "1": {
      "quote": "Ich kann Ilyas Arbeit und ihn persönlich mit voller Überzeugung empfehlen. Ich weiss nicht einmal, wo ich anfangen soll, seine Qualitäten hervorzuheben. Seine Persönlichkeit ist aussergewöhnlich, und das spiegelt sich in seiner Arbeit wider. Er ist kein typischer Programmierer. Ich habe das Gefühl, er hat dieses Fachgebiet nur angefangen, um seinen brillanten Geist zu befriedigen. Aber Ilyas Arbeit ist mehr als nur Programmieren. Sein Erfahrungsschatz scheint endlos zu sein, was seine Beiträge so wertvoll macht. Er kennt sich sowohl mit Kunst als auch mit aktuellen technologischen Entwicklungen aus. Seine Kreativität sprudelt über. Er investiert sich wirklich in seine Arbeit, anstatt nur eine Aufgabe zu erfüllen. Was wirklich wertvoll ist, ist, dass er zum Nutzen des Kunden beiträgt. Er denkt immer: „Was könnte sonst noch hilfreich sein? Was könnte diese neue Homepage noch aktueller machen?“ Dinge, die ich mir nicht einmal vorstellen konnte, sind für ihn alltäglich, und er baut sie ein. Er besitzt auch eine Geduld und Freundlichkeit, die unsere Zusammenarbeit unglaublich angenehm gemacht haben. Meine Einwände, Ideen, Wünsche... alles! Er hat immer alles zu Herzen genommen und umgesetzt. Selbst als meine Arbeit etwas Altmodisches erforderte, hat er sich absolut bemüht, die beste Lösung für mich zu finden. Es ist ein Geschenk, Ilya an meiner Seite zu haben, sowohl für das Design als auch für die Wartung meiner Homepage.",
      "clientName": "Daniela Hagmann",
      "clientTitle": "Co",
      "clientCompany": "Lebend-Ich"
    },
    "2": {
      "quote": "Wir waren unglaublich zufrieden mit Ilyas Beiträgen zu unserem Team. Er spielte eine Schlüsselrolle bei der Entwicklung mehrerer Komponenten unserer Haupt-PWA, behielt stets eine positive Einstellung bei und förderte eine grossartige Arbeitsatmosphäre. Ilya ist eine echte Bereicherung!",
      "clientName": "Tal Yaron",
      "clientTitle": "CEO",
      "clientCompany": "FreeDi"
    }
  },
  "aboutPage": {
    "titlePrefix": "Über",
    "titleSuffix": "HIEROGLYPH CODE",
    "intro1": "Willkommen bei Hieroglyph Code, einem Dienst für massgeschneiderte Softwarelösungen, geleitet von Ilya Medvedev, einem Full-Stack-Software-Ingenieur mit Sitz in Basel, Schweiz. Der Service kombiniert technisches Fachwissen mit kreativer Kunst, um professionelle, benutzerfreundliche und skalierbare digitale Erlebnisse zu liefern. Hieroglyph Code ist darauf spezialisiert, Lösungen zu entwickeln, die nicht nur funktional, sondern auch intuitiv und visuell ansprechend sind.",
    "intro2": "Hieroglyph Code widmet sich dem Bau von qualitativ hochwertigen Anwendungen, indem moderne Webtechnologien, KI-Werkzeuge und ein akribisches Auge für Details genutzt werden. Die Grundlage der Arbeit ist ein tiefes Wissen über TypeScript und Vanilla JavaScript, das die Lieferung robuster und skalierbarer Anwendungen mit Frameworks wie React, Next.js, React Native, Vue.js, Svelte.js, Node.js, CSS3 und SASS gewährleistet.",
    "servicesTitle": "Softwaredienstleistungen",
    "servicesIntro": "Bei Hieroglyph Code umfassen die Dienstleistungen die umfassende kundenspezifische Softwareentwicklung, vom anfänglichen Konzept bis zur endgültigen Bereitstellung:",
    "serviceList": {
      "fullStack": "Full Stack Web- & Mobilentwicklung: Responsive, robuste Anwendungen werden unter Verwendung moderner Technologien wie TypeScript, Vanilla JavaScript, React.js, Next.js, React Native, Vue.js, Svelte.js, Node.js, CSS3 und SASS gebaut.",
      "backEnd": "Back-End- & API-Entwicklung: Sichere und skalierbare Back-End-Dienste werden mit Node.js erstellt und kundenspezifische API-Entwicklung wird gehandhabt. Der Service hat umfangreiche Erfahrung mit verschiedenen Datenbanken, einschliesslich MongoDB, Firebase, MySQL und Postgres DB. Der Service integriert auch Plattformen wie Stripe für den E-Commerce.",
      "wordpress": "WordPress-Entwicklung & -Wartung: Die Dienstleistungen reichen vom Entwurf und Bau neuer E-Commerce-Websites mit Divi und Elementor bis zur Optimierung und Wartung bestehender Plattformen, mit einem besonderen Fokus auf die Anpassung von Plugins mittels PHP.",
      "aiTools": "KI-Werkzeuge & Integration: Plattformen wie Google AI Studio und Gemini werden genutzt, um Entwicklungsworkflows zu straffen, den Komponentencode zu optimieren und Inhaltsentwürfe für effiziente und innovative Lösungen zu generieren.",
      "devOps": "DevOps & Bereitstellung: Der Entwicklungs- und Bereitstellungsprozess wird mit modernen Werkzeugen wie Docker, GitLab und Heroku gestrafft. Dies umfasst wesentliche Dienste wie SSL- und DNS-Implementierung, um eine sichere und zuverlässige Online-Präsenz zu gewährleisten.",
      "uiUx": "UI/UX-fokussierte Entwicklung: Mit Kenntnissen in Tools wie Figma und Photoshop stellt Hieroglyph Code sicher, dass Anwendungen nicht nur leistungsstark, sondern auch eine Freude in der Nutzung sind, mit sorgfältiger Beachtung von Designdetails und Benutzerengagement."
    },
    "outro": "Hieroglyph Code ist bestrebt, klar zu kommunizieren und Lösungen zu liefern, die präzise auf die Kundenbedürfnisse zugeschnitten sind, immer mit einem Fokus auf sauberen, effizienten und leichten Code.",
    "ctaTitle": "Bereit, Ihr nächstes Projekt zu besprechen?",
    "ctaButton": "Kontakt aufnehmen"
  },
  "similarProducts": {
    "exploreOtherServices": "Andere Dienstleistungen erkunden"
  },
  "similarProjects": {
    "exploreOtherProjects": "Ähnliche Projekte entdecken"
  },
  "contactPage": {
    "title": "Kontakt",
    "imageCaption": "Basel, Schweiz",
    "description": "Bereit, Ihr Projekt zu besprechen? Hieroglyph Code hat seinen Sitz in Basel, Schweiz, und ist darauf spezialisiert, Ideen in die Realität umzusetzen. Nehmen Sie noch heute Kontakt auf, um ein Gespräch über Ihre individuellen Softwareanforderungen zu beginnen. Alle Anfragen werden in der Regel während der Bürozeiten beantwortet. Sie können direkt an die folgende E-Mail-Adresse schreiben oder das Kontaktformular verwenden.",
    "emailPrefix": "E-Mail:",
    "contactEmail": "contact@hieroglyphcode.ch",
    "connectTitle": "Lassen Sie uns in Kontakt treten",
    "connectDescription": "Obwohl die Arbeit hauptsächlich remote erfolgt, sind Beratungen in Basel oder per Videoanruf möglich, um Ihr Projekt im Detail zu besprechen.",
    "form": {
      "namePlaceholder": "Ihr Name",
      "emailPlaceholder": "Ihre E-Mail",
      "phonePlaceholder": "Ihre Telefonnummer",
      "messagePlaceholder": "Ihre Nachricht",
      "privacyAgreement": "Indem Sie dieses Kästchen ankreuzen, erklären Sie sich damit einverstanden, dass ich Sie kontaktieren darf, um Ihre Anfrage zu besprechen.",
      "submitButton": "Nachricht senden",
      "successMessage": "Nachricht erfolgreich gesendet!",
      "errorMessage": "Nachricht konnte nicht gesendet werden: "
    },
    "privacyError": "Bitte akzeptieren Sie die Datenschutzerklärung, um Ihre Nachricht zu senden."
  },
  "legalPage": {
    "mainTitle": "Datenschutz & Rechtliche Hinweise",
    "attributions": {
      "title": "Bildnachweise (Attributions)",
      "textPrefix": "Die Illustrationen auf dieser Website stammen von",
      "textSuffix": "."
    },
    "privacyPolicy": {
      "title": "Datenschutzerklärung",
      "section1": {
        "title": "Einleitung",
        "text": "Der Schutz Ihrer persönlichen Daten ist uns ein wichtiges Anliegen. In dieser Datenschutzerklärung informieren wir Sie darüber, welche personenbezogenen Daten wir erheben, wofür wir sie verwenden und welche Rechte Sie haben. Wir halten uns dabei an die Bestimmungen des schweizerischen Datenschutzgesetzes (revDSG) und, soweit anwendbar, der europäischen Datenschutz-Grundverordnung (DSGVO)."
      },
      "section2": {
        "title": "Verantwortliche Stelle",
        "text": "Verantwortlich für die Datenbearbeitung auf dieser Website ist der Betreiber dieser Website. Bei Fragen zum Datenschutz können Sie uns über das Kontaktformular auf dieser Website erreichen."
      },
      "section3": {
        "title": "Art und Umfang der Datenbearbeitung",
        "text": "a) Daten, die Sie uns zur Verfügung stellen\n\nWir verarbeiten personenbezogene Daten, die Sie uns freiwillig übermitteln, insbesondere wenn Sie unser Kontaktformular nutzen. Dazu gehören in der Regel: Name (optional), E-Mail-Adresse und der Inhalt Ihrer Nachricht. Diese Daten werden ausschliesslich zur Beantwortung Ihrer Anfragen und zur weiteren Kommunikation mit Ihnen verarbeitet.\n\nb) Daten, die automatisch erhoben werden\n\nBeim Besuch unserer Website erheben unsere Server automatisch technische Daten. Dazu gehören: die IP-Adresse Ihres Geräts, Datum und Uhrzeit des Zugriffs, Name der aufgerufenen Seite, Betriebssystem und Browsertyp sowie die Referral-URL. Diese Daten werden zur Gewährleistung der Sicherheit unserer Website, zur Fehleranalyse und zur statistischen Optimierung unseres Angebots verwendet."
      },
      "section4": {
        "title": "Zweck der Datenbearbeitung",
        "text": "Wir verarbeiten Ihre Daten für die folgenden Zwecke: zur Bearbeitung Ihrer Anfragen und zur Kommunikation mit Ihnen; zur Bereitstellung und Sicherstellung der Funktionalität und Sicherheit unserer Website und unserer Softwarelösungen; und zur statistischen Analyse der Website-Nutzung, um unser Angebot zu optimieren."
      },
      "section5": {
        "title": "Rechtsgrundlagen der Datenbearbeitung",
        "text": "Die Bearbeitung Ihrer Daten basiert auf den folgenden Rechtsgrundlagen: Ihre Einwilligung (z. B. durch Absenden des Kontaktformulars); und unser berechtigtes Interesse an der Datenbearbeitung (z. B. zur Verbesserung unseres Angebots)."
      },
      "section6": {
        "title": "Datenweitergabe an Dritte und Datenverarbeitung im Ausland",
        "text": "Wir geben Ihre Daten nur dann an Dritte weiter, wenn dies zur Erbringung unserer Dienstleistungen erforderlich ist (z.B. Hosting-Dienstleister) oder wenn eine gesetzliche Verpflichtung besteht. Unsere Website wird über Firebase Hosting bereitgestellt, mit Servern in Zürich (europe-west6). Die dort verarbeiteten Daten bleiben somit innerhalb der Schweiz. Für die statistische Analyse der Website-Nutzung setzen wir Google Analytics ein. Die dabei erhobenen Daten werden ebenfalls innerhalb der EU verarbeitet. Wir stellen sicher, dass diese Anbieter vertraglich verpflichtet sind, ein angemessenes Datenschutzniveau zu gewährleisten."
      },
      "section7": {
        "title": "Cookies und ähnliche Technologien",
        "text": "Derzeit verwenden wir auf unserer Website keine Cookies. Wir behalten uns jedoch das Recht vor, in Zukunft Cookies und ähnliche Technologien einzusetzen, um die Nutzung zu erleichtern und die Funktionalität zu verbessern. In diesem Fall werden Sie darüber informiert."
      },
      "section8": {
        "title": "Ihre Rechte als betroffene Person",
        "text": "Gemäss dem revDSG haben Sie die folgenden Rechte: das Recht auf Auskunft, das Recht auf Berichtigung, das Recht auf Löschung, das Recht auf Widerspruch und das Recht auf Widerruf der Einwilligung. Zur Ausübung Ihrer Rechte kontaktieren Sie uns bitte per E-Mail: contact@hieroglyphcode.ch oder über das Kontaktformular auf der Kontaktseite."
      },
      "section9": {
        "title": "Änderungen an dieser Datenschutzerklärung",
        "text": "Wir behalten uns das Recht vor, diese Datenschutzerklärung jederzeit zu ändern. Die jeweils aktuelle Version wird auf dieser Seite veröffentlicht."
      }
    }
  }
}